I was using the same provider and terraform version and failed to reproduce the issue. 

terraform apply
data.oci_objectstorage_namespace.ns: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_objectstorage_bucket.bucket1 will be created
  + resource "oci_objectstorage_bucket" "bucket1" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaa46mzzhyehfzyvkgjq5xgd6zgga7fulw4elmnvq2tohpfvihbqdya"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "tf-example-bucket"
      + namespace                    = "dxterraformdev"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
      + versioning                   = (known after apply)
    }

  # oci_objectstorage_object.test_object_json will be created
  + resource "oci_objectstorage_object" "test_object_json" {
      + bucket                     = "tf-example-bucket"
      + content                    = "564ba98b94ba655dfde3a8d5d7704efa"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = (known after apply)
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "dxterraformdev"
      + object                     = "content.json"
      + state                      = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


Warning: Interpolation-only expressions are deprecated

  on main.tf line 16, in provider "oci":
  16:   region           = "${var.region}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 8 more similar warnings elsewhere)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oci_objectstorage_bucket.bucket1: Creating...
oci_objectstorage_bucket.bucket1: Creation complete after 1s [id=n/dxterraformdev/b/tf-example-bucket]
oci_objectstorage_object.test_object_json: Creating...
oci_objectstorage_object.test_object_json: Creation complete after 2s [id=n/dxterraformdev/b/tf-example-bucket/o/content.json]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
zexwan-mac:debug zexwan$ terraform apply
data.oci_objectstorage_namespace.ns: Refreshing state...
oci_objectstorage_bucket.bucket1: Refreshing state... [id=n/dxterraformdev/b/tf-example-bucket]
oci_objectstorage_object.test_object_json: Refreshing state... [id=n/dxterraformdev/b/tf-example-bucket/o/content.json]

Warning: Interpolation-only expressions are deprecated

  on main.tf line 16, in provider "oci":
  16:   region           = "${var.region}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 8 more similar warnings elsewhere)


Apply complete! Resources: 0 added, 0 changed, 0 destroyed.


I think I might be missing some detail about vcn.

vcn = module.dp_vcn.vcn_details

can you Provide me the full config of the content file with value of "local.vmsOutput" ,"local.lbrOutput", "module.dp_vcn.vcn_details" and "local.subnetOutput" so we can try again? Thank you.